app/controllers/group_controller.rb

SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 1 AND `groups`.`name` = 'os'
INSERT INTO `groups` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('SD', 1, '2018-04-05 17:10:46', '2018-04-05 17:10:46')
---
    def add_group
        params.require(:group).permit!
        params[:group][:user_id] = params[:id]
        matched_group = Group.where(user_id: params[:group][:user_id], name: params[:group][:name])[0]
        if matched_group
            render json: {status: false, message: "group already exists"}
        else
            @group = Group.new(params[:group])
            if @group.save