app/controllers/user_controller.rb

    def list_group_users
        @user = User.find_by_id(params[:uid])
        @group = @user.groups_created.find_by_id(params[:gid])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1